import time
import random
All_List={1:"沈斌",2:"毕莉莎",3:"张萍",4:"俞欣",5:"周自强",6:"马宁",7:"李圣民"
    ,8:"施家骏",9:"陈耀麒",10:"潘东义",11:"陆庆",12:"徐月芳",13:"姚红雅",14:"陆佳豪"
    ,15:"项安平",16:"王德福",17:"周典",18:"于峰",19:"宥永伟",20:"邹坤",21:"杨涛"
    ,22:"谢运动",23:"陆文雨",24:"陈雷",25:"常跟磊",26:"于鲁玉",27:"张结",28:"宋鑫淼",29:"邵广浩"
    ,30:"刘成林",31:"雷文博",32:"梅久峰",33:"李天骄",34:"郏庆锋",35:"于鲁祥",36:"陈涛",37:"罗辉连"
    ,38:"单晓莱",39:"周孟孟",40:"吕英磊",41:"顾燕",42:"周洁",43:"高艳红",44:"王燕雯",45:"俞静娴"
    ,46:"郑英",47:"吴燕",48:"李鸿璐",49:"徐凌",50:"罗均学",51:"吴丹"}  #建立一个集团所有人对应的编号

Number_list=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30
    ,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51]   #所有人员编号集合

L1=[]   #抽出的一等奖集合
L1_Name=[] #建立一个一等奖名单
L2=[]   #抽出的二等奖集合
L2_Name=[] #建立一个二等奖名单
L3=[]   #抽出的三等奖集合
L3_Name=[] #建立一个三等奖名单
Max_times=52 #定义一下抽奖数量最大值（防止报错）
remain_times=52 #定义一个剩余抽奖最大值

Level=int(input('请输入抽奖等级（1，2,3）： '))
Times=int(input('请输入本次抽奖数量: '))
for i in range(Times):
    k=random.randint(0,Max_times) #在编号总数之内取随机数

    if Level==1:
        x=Number_list.pop(k)
        L1.append(x)   #把抽到的编号放入到对应的列表
    elif Level==2:
        x=Number_list.pop(k)
        L2.append(x)
    elif Level==3:
        x=Number_list.pop(k)
        L3.append(x)
    else:
        print('输入错误，请重新运行！')

    Max_times-=1
for j in L1:          #通过抽到的人员编号列表去总人员字典里查询对应的人名（L1代表一等奖名单）
    o=All_List[j]
    L1_Name.append(o)
for j in L2:
    o=All_List[j]
    L2_Name.append(o)
for j in L3:
    o=All_List[j]
    L3_Name.append(o)

if Level==1:
    print('一等奖的编号是',L1," \n对应的名字分别是",L1_Name)
if Level==2:
    print('二等奖的编号是',L2,"\n对应的名字分别是",L2_Name)
if Level==3:
    print('三等奖的编号是',L3,"\n对应的名字分别是",L3_Name)

print(Number_list)  #剔除每次中奖人员之后的剩余名单
